---
kind: type
id: T:Autodesk.Revit.DB.TextTreatment
source: html/bff3cf18-0cd1-723f-a4ce-38b3127d698e.htm
---
# Autodesk.Revit.DB.TextTreatment

An enumerated type listing possible text treatment modes.

## Syntax (C#)
```csharp
public enum TextTreatment
```